---
kind: property
id: P:Autodesk.Revit.DB.MeshTriangle.Index(System.Int32)
source: html/a24d3786-5407-96ee-da48-577bbd33a6ba.htm
---
# Autodesk.Revit.DB.MeshTriangle.Index Property

The index of the vertex in the Vertices array of the mesh, for indexed access.

## Syntax (C#)
```csharp
public uint this[
	int idx
] { get; }
```

## Parameters
- **idx** (`System.Int32`) - Index of the vertex in the triangle: 0, 1 or 2.